inquisitiveness/inquisitiveness.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Inquisitiveness</title>
<!-- 2015-11-10 Tue 14:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Rick Neff" />
</head>
<body>
<div id="content">
<h1 class="title">Inquisitiveness</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">EN10</h2>
<div class="outline-text-2" id="text-1">
<p>
You are invited to inquisitively evaluate algorithm efficiency using
Big-Oh <b>and</b> empirical measurements. This invitation to exploration
is codenamed <i>Inquisitiveness</i>.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Background</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><i>Empirical</i> means based on experimental data, not on a theory.
</li>
<li>It means originating in or based upon observation or experience;
capable of being verified or disproved by observation or
experiment;
</li>
<li>It is derived from observation, experience or experiment rather
than from conjecture, hypothesis or theory.
</li>
</ul>

<p>
So, empirical information is based on perception with the five
senses rather than thinking and rationalism. In other words, it is
based on <i>practical</i> experience. It is often called <i>benchmarking</i>.
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">General Plan for Empirical Experimentation</h4>
<div class="outline-text-4" id="text-1-1-1">
<ol class="org-ol">
<li>Understand the experiment's purpose.
</li>
<li>Decide on the efficiency metric <b>M</b> to be measured and the
measurement unit (an operation's count or a time unit).
</li>
<li>Decide on characteristics of the input sample (its range,
size, and so on).
</li>
<li>Prepare a program implementing the algorithm (or
algorithms) for the experimentation.
</li>
<li>Generate a sample of inputs.
</li>
<li>Run the algorithm (or algorithms) on the sample's inputs
and record the data observed.
</li>
<li>Analyze the data obtained.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">Important Points</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Three points to bear in mind when analyzing algorithm efficiency
empirically in the context of this exploration:
</p>

<ol class="org-ol">
<li>You are <b>not</b> given specific algorithms to measure and compare,
just specific algorithm <b>types</b>.
</li>
<li>You thus have great latitude in how to conduct and report on
your experiments, so use your cohort collaboration to the max.
</li>
<li>You may study/use any code found in <a href="http://firstthreeodds.org/cs306/empirical.zip">http://firstthreeodds.org/cs306/empirical.zip</a>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Requirements</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Implement two "n-squared" sorting algorithms and two "n log n"
algorithms of your choice using any language you choose (mixing languages
if you choose, but see the questions below). Analyze the four algorithms
and show how you found the running times for each. Do an empirical
measurement of the running times on each of the four algorithms and
compare the results with the theoretical running time. When doing the
empirical measurements, you will probably need to loop over most
problem sizes several times so they produce measurable run times.
Make available all code and scripts you use to obtain the running times.
</p>

<p>
For maximum benefit, treat this as an open-ended project, and
explore some additional factors affecting runtime. For example,
answer these questions, and then some:
</p>

<ol class="org-ol">
<li>How does the language (Java, C++, etc.),
including compiler switches, affect performance?
</li>
<li>How does the data type (<b>int</b>, <b>float</b>, etc.) to be sorted
affect performance?
</li>
<li>When does overhead from recursion affect performance?
</li>
<li>How does the operating system affect the performance of the algorithms? 
</li>
<li>How do the theoretical running time and the empirical running time
compare? If they are different, why are they different?
</li>
<li>How does optimization of a compiler affect performance?
</li>
<li>What are the pros and cons of each algorithm based on
the theoretical and the empirical analysis?
</li>
<li>Are there situations where a slow algorithm is acceptable to use
in an application?
</li>
<li>Are there situations where a fast algorithms might be the only option?
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Expectations</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Do work that you can take pride in reporting on.
</li>
<li>Make your report look and feel professional &#x2014; which for starters
means to eradicate all mechanical infelicities.
</li>
<li>Include an introduction (clearly stating the goal(s) of this
activity) and a conclusion (summarizing the analysis).
</li>
<li>Mention the hardware, compiler, timers used, and any and all
assumptions made.
</li>
<li><b>Be specific</b> about what the best case,
average case, and worst case are for each algorithm.
</li>
<li>Include a comparison of timings for each sort. It's acceptable
and desirable to plot your timings for multiple sorts on the same
graph, but also include a table of your timings.
</li>
<li>Include a comparison of the two "n-squared" algorithms and a
comparison of the two "n log n" algorithms, but <b>NOT</b> a
comparison of an "n-squared" with an "n log n" algorithm, which
doesn't make sense.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">What is True?</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun what-is-true-about-my-engagement-with-inquisitiveness ()
  "If need be, replace a 100 with a smaller number to reflect how much you feel you deserve."
  (vector
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true of my experience in general?                              ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["I collaborated with the classmates in my cohort." 100]
["I learned something new." 100]
["I achieved something meaningful, or something I can build upon at a later time." 100]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true of my report on what I learned?                            ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["I learned more about emacs 'org' mode in my use of it to write my report." 100]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true about my meeting explicit requirements?                    ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["I explored factors affecting runtime, and answered at least 5 of the 9 questions." 100]
["I explored factors affecting runtime, and answered at least 6 of the 9 questions." 100]
["I explored factors affecting runtime, and answered at least 7 of the 9 questions." 100]
["I explored factors affecting runtime, and answered at least 8 of the 9 questions." 100]
["I explored factors affecting runtime, and answered all of the 9 questions, and a few more of my own." 100]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true of the mechanical "infelicities" (misspelled words,        ;;
;; grammatical errors, punctuation errors) in my report on what I learned? ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["There are fewer than four." 100]
["There are fewer than three." 100]
["There are fewer than two." 100]
["There are none." 100]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is otherwise true of the quality of the information in my report?  ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["Each detail contributes to the report's purpose, with no distracting, extraneous information." 100]
["There are no unstated assumptions, and the arguments are logical and concise." 100]
["As confirmed by having someone not in my cohort read it, the reader can readily see what is going on in my head." 100]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is otherwise true of the organization of my report?                ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["My report's information is presented in a logical sequence, easily followed." 100]
["My report has a strong introduction, clearly stating the goal of this exploration." 100]
["My report has a strong conclusion, summarizing my analysis." 100]
["My report has pithy headings to guide the information flow." 100]
["The information flow in my report has engaging transitions that entice the reader to read further." 100]
))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rick Neff</p>
<p class="date">Created: 2015-11-10 Tue 14:25</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
